{"/about/":{"data":{"":"Hextra is designed to be a simple, fast, and flexible theme for building modern static websites. It is especially well-suited for documentation websites but can also be used for various types of sites, such as blogs, portfolios, and more.\nHugo, like Jekyll, is a static site generator. What sets Hugo apart is that it is a single binary, making it easy to install and run on various platforms. It is also extremely fast and reliable, capable of rendering a site with thousands of pages in milliseconds.\nHextra is built with a mindset focused on having a minimal footprint. To get started, no extra dependencies like Node.js packages are required; all you need is a single YAML configuration file, along with your Markdown content. Thus, we can focus on writing quality content instead of setting up tooling.","credits#Credits":"Hextra cannot be built without the following tools and inspirations:\nHugo Tailwind CSS Heroicons Nextra Next.js "},"title":"About"},"/blog/":{"data":{"":" RSS Feed "},"title":"Blog"},"/docs/":{"data":{"":"👋 Hello! Welcome to the Hextra documentation!","features#Features":" Beautiful Design - Inspired by Nextra, Hextra utilizes Tailwind CSS to offer a modern design that makes your site look outstanding. Responsive Layout and Dark Mode - It looks great on all devices, from mobile, tablet to desktop. Dark mode is also supported to accommodate various lighting conditions. Fast and Lightweight - Powered by Hugo, a lightning-fast static-site generator housed in a single binary file, Hextra keeps its footprint minimal. No JavaScript or Node.js are needed to use it. Full-text Search - Built-in offline full-text search powered by FlexSearch, no additional configuration required. Battery-included - Markdown, syntax highlighting, LaTeX math formulae, diagrams and Shortcodes elements to enhance your content. Table of contents, breadcrumbs, pagination, sidebar navigation and more are all automatically generated. Multi-language and SEO Ready - Multi-language sites made easy with Hugo’s multilingual mode. Out-of-the-box support is included for SEO tags, Open Graph, and Twitter Cards. ","next#Next":"Dive right into the following section to get started:\nGetting StartedLearn how to create website using Hextra ","questions-or-feedback#Questions or Feedback?":" ❓ Hextra is still in active development. Have a question or feedback? Feel free to open an issue! ","what-is-hextra#What is Hextra?":"Hextra is a modern, fast and batteries-included [Hugo][hugo] theme built with [Tailwind CSS][tailwind-css].\nDesigned for building beautiful websites for documentation, blogs, and websites, it provides out-of-the-box features and flexibility to meet various requirements."},"title":"Documentation"},"/docs/advanced/":{"data":{"":"This section covers some advanced topics of the theme.\nMulti-language Customization Comments System "},"title":"Advanced"},"/docs/advanced/comments/":{"data":{"":"Hextra supports adding comments system to your site. Currently giscus is supported.","giscus#giscus":"giscus is a comments system powered by GitHub Discussions. It is free and open source.\nTo enable giscus, you need to add the following to the site configuration file:\nhugo.yamlparams: comments: enable: false type: giscus giscus: repo: \u003crepository\u003e repoId: \u003crepository ID\u003e category: \u003ccategory\u003e categoryId: \u003ccategory ID\u003e The giscus configurations can be constructed from the giscus.app website. More details can also be found there.\nComments can be enabled or disabled for a specific page in the page front matter:\ncontent/docs/about.md--- title: About comments: true --- "},"title":"Comments"},"/docs/advanced/customization/":{"data":{"":"Hextra offers some default customization options in the hugo.yaml config file to configure the theme. This page describes the available options and how to customize the theme further.","custom-css#Custom CSS":"To add custom CSS, we need to create a file assets/css/custom.css in our site. Hextra will automatically load this file.\nFont Family The font family of the content can be customized using:\nassets/css/custom.css.content { font-family: \"Times New Roman\", Times, serif; } Inline Code Element The color of text mixed with other text can customized with:\nassets/css/custom.css.content code:not(.code-block code) { color: #c97c2e; } Primary Color The primary color of the theme can be customized by setting the --primary-hue, --primary-saturation and --primary-lightness variables:\nassets/css/custom.css:root { --primary-hue: 100deg; --primary-saturation: 90%; --primary-lightness: 50%; } Further Theme Customization The theme can be further customized by overriding the default styles via the exposed css classes. An example for customizing the footer element:\nassets/css/custom.css.hextra-footer { /* Styles will be applied to the footer element */ } .hextra-footer:is(html[class~=\"dark\"] *) { /* Styles will be applied to the footer element in dark mode */ } The following classes can be used to customize various parts of the theme.\nGeneral hextra-scrollbar - The scrollbar element content - Page content container Shortcodes Badge hextra-badge - The badge element Card hextra-card - The card element hextra-card-image - The card image element hextra-card-icon - The card icon element hextra-card-subtitle - The card subtitle element Cards hextra-cards - The cards grid container Jupyter Notebook hextra-jupyter-code-cell - The Jupyter code cell container hextra-jupyter-code-cell-outputs-container - The Jupyter code cell outputs container hextra-jupyter-code-cell-outputs - The Jupyter code cell output div element PDF hextra-pdf - The PDF container element Steps steps - The steps container Tabs hextra-tabs-panel - The tabs panel container hextra-tabs-toggle - The tabs toggle button Filetree hextra-filetree - The filetree container Folder hextra-filetree-folder - The filetree folder container Navbar nav-container - The navbar container nav-container-blur - The navbar container in blur element hamburger-menu - The hamburger menu button Footer hextra-footer - The footer element hextra-custom-footer - The custom footer section container Search search-wrapper - The search wrapper container search-input - The search input element search-results - The search results list container Table of Contents hextra-toc - The table of contents container Sidebar mobile-menu-overlay - The overlay element for the mobile menu sidebar-container - The sidebar container sidebar-active-item - The active item in the sidebar Language Switcher language-switcher - The language switcher button language-options - The language options container Theme Toggle theme-toggle - The theme toggle button Code Copy Button hextra-code-copy-btn-container - The code copy button container hextra-code-copy-btn - The code copy button Code Block hextra-code-block - The code block container Feature Card hextra-feature-card - The feature card link element Feature Grid hextra-feature-grid - The feature grid container Breadcrumbs No specific class is available for breadcrumbs.\nSyntax Highlighting List of available syntax highlighting themes are available at Chroma Styles Gallery. The stylesheet can be generated using the command:\nhugo gen chromastyles --style=github To override the default syntax highlighting theme, we can add the generated styles to the custom CSS file.","custom-extra-section-in-footer#Custom Extra Section in Footer":"You can add extra section in the footer by creating a file layouts/partials/custom/footer.html in your site.\nlayouts/partials/custom/footer.html\u003c!-- Your footer element here --\u003e The added section will be added before the copyright section in the footer. You can use HTML and Hugo template syntax to add your own content.\nHugo variables available in the footer section are: .switchesVisible and .displayCopyright.","custom-layouts#Custom Layouts":"The layouts of the theme can be overridden by creating a file with the same name in the layouts directory of your site. For example, to override the single.html layout for docs, create a file layouts/docs/single.html in your site.\nFor further information, refer to the [Hugo Templates][hugo-template-docs].","custom-scripts#Custom Scripts":"You may add custom scripts to the end of the head for every page by adding the following file:\nlayouts/partials/custom/head-end.html ","further-customization#Further Customization":"Didn’t find what you were looking for? Feel free to open a discussion or make a contribution to the theme!"},"title":"Customization"},"/docs/advanced/multi-language/":{"data":{"":"Hextra supports creating site with multiple languages using Hugo’s multilingual mode.","enable-multi-language#Enable Multi-language":"To make our site multi-language, we need to tell Hugo the supported languages. We need to add to the site configuration file:\nhugo.yamldefaultContentLanguage: en languages: en: languageName: English weight: 1 fr: languageName: Français weight: 2 ja: languageName: 日本語 weight: 3 ","manage-translations-by-filename#Manage Translations by Filename":"Hugo supports managing translations by filename. For example, if we have a file content/docs/_index.md in English, we can create a file content/docs/_index.fr.md for French translation.\ncontent docs _index.md _index.fr.md _index.ja.md Note: Hugo also supports Translation by content directory.","read-more#Read More":" Hugo Multilingual Mode Hugo Multilingual Part 1: Content translation Hugo Multilingual Part 2: Strings localization ","translate-menu-items#Translate Menu Items":"To translate menu items in the navigation bar, we need to set the identifier field:\nhugo.yamlmenu: main: - identifier: documentation name: Documentation pageRef: /docs weight: 1 - identifier: blog name: Blog pageRef: /blog weight: 2 and translate them in the corresponding i18n file:\ni18n/fr.yamldocumentation: Documentation blog: Blog ","translate-strings#Translate Strings":"To translate strings on the other places, we need to add the translation to the corresponding i18n file:\ni18n/fr.yamlreadMore: Lire la suite A list of strings used in the theme can be found in the i18n/en.yaml file."},"title":"Multi-language"},"/docs/getting-started/":{"data":{"":"","next#Next":"Explore the following sections to start adding more contents:\nOrganize Files Configuration Markdown ","quick-start-from-template#Quick Start from Template":" imfing/hextra-starter-template\nYou could quickly get started by using the above template repository.\nWe have provided a GitHub Actions workflow which can help automatically build and deploy your site to GitHub Pages, and host it for free. For more options, check out Deploy Site.\n🌐 Demo ↗","start-as-new-project#Start as New Project":"There are two main ways to add the Hextra theme to your Hugo project:\nHugo Modules (Recommended): The simplest and recommended method. Hugo modules let you pull in the theme directly from its online source. Theme is downloaded automatically and managed by Hugo.\nGit Submodule: Alternatively, add Hextra as a Git Submodule. The theme is downloaded by Git and stored in your project’s themes folder.\nSetup Hextra as Hugo module Prerequisites Before starting, you need to have the following software installed:\nHugo (extended version) Git Go Steps Initialize a new Hugo site hugo new site my-site --format=yaml Configure Hextra theme via module # initialize hugo module cd my-site hugo mod init github.com/username/my-site # add Hextra theme hugo mod get github.com/imfing/hextra Configure hugo.yaml to use Hextra theme by adding the following:\nmodule: imports: - path: github.com/imfing/hextra Create your first content pages Create new content page for the home page and the documentation page:\nhugo new content/_index.md hugo new content/docs/_index.md Preview the site locally hugo server --buildDrafts --disableFastRender Voila, your new site preview is available at http://localhost:1313/.\nHow to update theme? To update all Hugo modules in your project to their latest versions, run the following command:\nhugo mod get -u To update Hextra to the latest released version, run the following command:\nhugo mod get -u github.com/imfing/hextra See Hugo Modules for more details.\nSetup Hextra as Git submodule Prerequisites Before starting, you need to have the following software installed:\nHugo (extended version) Git Steps Initialize a new Hugo site hugo new site my-site --format=yaml Add Hextra theme as a Git submodule git submodule add https://github.com/imfing/hextra.git themes/hextra Configure hugo.yaml to use Hextra theme by adding the following:\ntheme: hextra Create your first content pages Create new content page for the home page and the documentation page:\nhugo new content/_index.md hugo new content/docs/_index.md Preview the site locally hugo server --buildDrafts --disableFastRender Your new site preview is available at http://localhost:1313/.\nWhen using CI/CD for Hugo website deployment, it’s essential to ensure that the following command is executed before running the hugo command.\ngit submodule update --init Failure to run this command results in the theme folder not being populated with Hextra theme files, leading to a build failure.\nHow to update theme? To update all submodules in your repository to their latest commits, run the following command:\ngit submodule update --remote To update Hextra to the latest commit, run the following command:\ngit submodule update --remote themes/hextra See Git submodules for more details."},"title":"Getting Started"},"/docs/guide/":{"data":{"":"Explore the following sections to learn how to use Hextra:\nOrganize Files Configuration Markdown Syntax Highlighting LaTeX Diagrams Shortcodes Deploy Site "},"title":"Guide"},"/docs/guide/configuration/":{"data":{"":"Hugo reads its configuration from hugo.yaml in the root of your Hugo site. The config file is where you can configure all aspects of your site. Check out the config file for this site exampleSite/hugo.yaml on GitHub to get a comprehensive idea of available settings and best practices.","footer#Footer":"Copyright To modify the copyright text displayed in your website’s footer, you’ll need to create a file named i18n/en.yaml. In this file, specify your new copyright text as shown below:\ni18n/en.yamlcopyright: \"© 2024 YOUR TEXT HERE\" For your reference, an example i18n/en.yaml file can be found in the GitHub repository. Additionally, you could use Markdown format in the copyright text.","navigation#Navigation":"Menu Top right menu is defined under the menu.main section in the config file:\nhugo.yamlmenu: main: - name: Documentation pageRef: /docs weight: 1 - name: Blog pageRef: /blog weight: 2 - name: About pageRef: /about weight: 3 - name: Search weight: 4 params: type: search - name: GitHub weight: 5 url: \"https://github.com/imfing/hextra\" params: icon: github There are different types of menu items:\nLink to a page in the site with pageRef - name: Documentation pageRef: /docs Link to an external URL with url - name: GitHub url: \"https://github.com\" Search bar with type: search - name: Search params: type: search Icon - name: GitHub params: icon: github These menu items can be sorted by setting the weight parameter.\nLogo and Title To modify the default logo, edit hugo.yaml and add the path to your logo file under static directory. Optionally, you can change the link that users are redirected to when clicking on your logo, as well as set the width \u0026 height of the logo in pixels.\nhugo.yamlparams: navbar: displayTitle: true displayLogo: true logo: path: images/logo.svg dark: images/logo-dark.svg link: / width: 40 height: 20 ","others#Others":"Favicon To customize the favicon for your site, place icon files under the static folder to override the default favicons from the theme:\nstatic android-chrome-192x192.png android-chrome-512x512.png apple-touch-icon.png favicon-16x16.png favicon-32x32.png favicon-dark.svg favicon.ico favicon.svg site.webmanifest Include favicon.ico, favicon.svg and favicon-dark.svg files in your project to ensure your site’s favicons display correctly.\nWhile favicon.ico is generally for older browsers, favicon.svg and favicon-dark.svg are supported by modern browsers. Use tools like favicon.io or favycon to generate such icons.\nTheme Configuration Use the theme setting to configure the default theme mode and toggle button, allowing visitors to switch between light or dark mode.\nhugo.yamlparams: theme: # light | dark | system default: system displayToggle: true Options for theme.default:\nlight - always use light mode dark - always use dark mode system - sync with the operating system setting (default) The theme.displayToggle parameter allows you to display a toggle button for changing themes. When set to true, visitors can switch between light or dark mode, overriding the default setting.\nPage Last Modification The date of the page’s last modification can be displayed by enabling the params.displayUpdatedDate flag. To use Git commit date as the source, enable also the enableGitInfo flag.\nTo customize the date format, set the params.dateFormat parameter. Its layout matches Hugo’s time.Format.\nhugo.yaml# Parse Git commit enableGitInfo: true params: # Display the last modification date displayUpdatedDate: true dateFormat: \"January 2, 2006\" Page Width The width of the page can be customized by the params.page.width parameter in the config file:\nhugo.yamlparams: page: # full (100%), wide (90rem), normal (1280px) width: wide There are three available options: full, wide, and normal. By default, the page width is set to normal.\nSimilarly, the width of the navbar and footer can be customized by the params.navbar.width and params.footer.width parameters.\nFlexSearch Index Full-text search powered by FlexSearch is enabled by default. To customize the search index, set the params.search.flexsearch.index parameter in the config file:\nhugo.yamlparams: # Search search: enable: true type: flexsearch flexsearch: # index page by: content | summary | heading | title index: content Options for flexsearch.index:\ncontent - full content of the page (default) summary - summary of the page, see Hugo Content Summaries for more details heading - level 1 and level 2 headings title - only include the page title To customize the search tokenize, set the params.search.flexsearch.tokenize parameter in the config file:\nhugo.yamlparams: # ... flexsearch: # full | forward | reverse | strict tokenize: forward Options for flexsearch.tokenize:\nstrict - index whole words forward - incrementally index words in forward direction reverse - incrementally index words in both directions full - index every possible combination To exclude a page from the FlexSearch search index, set the excludeSearch: true in the front matter of the page:\ncontent/docs/guide/configuration.md--- title: Configuration excludeSearch: true --- Google Analytics To enable Google Analytics, set services.googleAnalytics.ID flag in hugo.yaml:\nhugo.yamlservices: googleAnalytics: ID: G-MEASUREMENT_ID Google Search Index To block Google Search from indexing a page, set noindex to true in your page frontmatter:\ntitle: Configuration (archive version) params: noindex: true To exclude an entire directory, use the cascade key in the parent _index.md file.\nNote\nTo block search crawlers, you can make a robots.txt template. However, robots.txt instructions do not necessarily keep a page out of Google search results.","right-sidebar#Right Sidebar":"Table of Contents Table of contents is automatically generated from the headings in the content file. It can be disabled by setting toc: false in the front matter of the page.\ncontent/docs/guide/configuration.md--- title: Configuration toc: false --- Page Edit Link To configure the page edit link, we can set the params.editURL.base parameter in the config file:\nhugo.yamlparams: editURL: enable: true base: \"https://github.com/your-username/your-repo/edit/main\" The edit links will be automatically generated for each page based on the provided url as root directory. If you want to set edit link for a specific page, you can set the editURL parameter in the front matter of the page:\ncontent/docs/guide/configuration.md--- title: Configuration editURL: \"https://example.com/edit/this/page\" --- ","sidebar#Sidebar":"Main Sidebar For the main sidebar, it is automatically generated from the structure of the content directory. See the Organize Files page for more details.\nTo exclude a single page from the left sidebar, set the sidebar.exclude parameter in the front matter of the page:\ncontent/docs/guide/configuration.md--- title: Configuration sidebar: exclude: true --- Extra Links Sidebar extra links are defined under the menu.sidebar section in the config file:\nhugo.yamlmenu: sidebar: - name: More params: type: separator weight: 1 - name: \"About\" pageRef: \"/about\" weight: 2 - name: \"Hugo Docs ↗\" url: \"https://gohugo.io/documentation/\" weight: 3 "},"title":"Configuration"},"/docs/guide/deploy-site/":{"data":{"":"Hugo generates static websites, allowing for flexible hosting options. This page provides guides for deploying your Hextra site on various platforms.","cloudflare-pages#Cloudflare Pages":" Put your site source code in a Git repository (e.g. GitHub) Log in to the Cloudflare dashboard and select your account In Account Home, select Workers \u0026 Pages \u003e Create application \u003e Pages \u003e Connect to Git Select the repository, and in the Set up builds and deployments section, provide the following information: Configuration Value Production branch main Build command hugo --gc --minify Build directory public For more details, check out:\nDeploy a Hugo site. Language support and tools. ","github-pages#GitHub Pages":"GitHub Pages is the recommended way to deploy and host your website for free.\nIf you bootstrap the site using hextra-starter-template, it has provided GitHub Actions workflow out-of-the-box that helps automatically deploy to GitHub Pages.\nGitHub Actions Configuration Below is an example configuration from hextra-starter-template:\n.github/workflows/pages.yaml# Sample workflow for building and deploying a Hugo site to GitHub Pages name: Deploy Hugo site to Pages on: # Runs on pushes targeting the default branch push: branches: [\"main\"] # Allows you to run this workflow manually from the Actions tab workflow_dispatch: # Sets permissions of the GITHUB_TOKEN to allow deployment to GitHub Pages permissions: contents: read pages: write id-token: write # Allow only one concurrent deployment, skipping runs queued between the run in-progress and latest queued. # However, do NOT cancel in-progress runs as we want to allow these production deployments to complete. concurrency: group: \"pages\" cancel-in-progress: false # Default to bash defaults: run: shell: bash jobs: # Build job build: runs-on: ubuntu-latest env: HUGO_VERSION: 0.147.7 steps: - name: Checkout uses: actions/checkout@v4 with: fetch-depth: 0 # fetch all history for .GitInfo and .Lastmod submodules: recursive - name: Setup Go uses: actions/setup-go@v5 with: go-version: '1.22' - name: Setup Pages id: pages uses: actions/configure-pages@v4 - name: Setup Hugo run: | wget -O ${{ runner.temp }}/hugo.deb https://github.com/gohugoio/hugo/releases/download/v${HUGO_VERSION}/hugo_extended_${HUGO_VERSION}_linux-amd64.deb \\ \u0026\u0026 sudo dpkg -i ${{ runner.temp }}/hugo.deb - name: Build with Hugo env: # For maximum backward compatibility with Hugo modules HUGO_ENVIRONMENT: production HUGO_ENV: production run: | hugo \\ --gc --minify \\ --baseURL \"${{ steps.pages.outputs.base_url }}/\" - name: Upload artifact uses: actions/upload-pages-artifact@v3 with: path: ./public # Deployment job deploy: environment: name: github-pages url: ${{ steps.deployment.outputs.page_url }} runs-on: ubuntu-latest needs: build steps: - name: Deploy to GitHub Pages id: deployment uses: actions/deploy-pages@v4 In your repository settings, set the Pages \u003e Build and deployment \u003e Source to GitHub Actions: By default, the above GitHub Actions workflow .github/workflows/pages.yaml assumes that the site is deploying to https://\u003cUSERNAME\u003e.github.io/\u003cREPO\u003e/.\nIf you are deploying to https://\u003cUSERNAME\u003e.github.io/ then modify the --baseURL:\n.github/workflows/pages.yaml 54 55 56 57 run: | hugo \\ --gc --minify \\ --baseURL \"https://${{ github.repository_owner }}.github.io/\" If you are deploying to your own domain, please change the --baseURL value accordingly.","netlify#Netlify":" Push your code to your Git repository (GitHub, GitLab, etc.) Import the project to Netlify If you are not using [hextra-starter-template][hextra-starter-template], configure the following manually: Configure the Build command to hugo --gc --minify Specify the Publish directory to public Add Environment variable HUGO_VERSION and set to 0.147.7, or alternatively, set it in netlify.toml file Deploy! Check Hugo on Netlify for more details.","vercel#Vercel":" Push your code to your Git repository (GitHub, GitLab, etc.) Go to Vercel Dashboard and import your Hugo project Configure the project, select Hugo as Framework Preset Override the Build Command and Install command: Set Build Command to hugo --gc --minify Set Install Command to yum install golang "},"title":"Deploy Site"},"/docs/guide/diagrams/":{"data":{"":"Currently, Hextra supports Mermaid for diagrams.","mermaid#Mermaid":"Mermaid is a JavaScript based diagramming and charting tool that takes Markdown-inspired text definitions and creates diagrams dynamically in the browser. For example, Mermaid can render flow charts, sequence diagrams, pie charts and more.\nUsing Mermaid in Hextra is as simple as writing a code block with language set mermaid:\n```mermaid graph TD; A--\u003eB; A--\u003eC; B--\u003eD; C--\u003eD; ``` will be rendered as:\ngraph TD; A--\u003eB; A--\u003eC; B--\u003eD; C--\u003eD; Sequence diagram:\nsequenceDiagram participant Alice participant Bob Alice-\u003e\u003eJohn: Hello John, how are you? loop Healthcheck John-\u003e\u003eJohn: Fight against hypochondria end Note right of John: Rational thoughts \u003cbr/\u003eprevail! John--\u003e\u003eAlice: Great! John-\u003e\u003eBob: How about you? Bob--\u003e\u003eJohn: Jolly good! For more information, please refer to Mermaid Documentation."},"title":"Diagrams"},"/docs/guide/latex/":{"data":{"":"KaTeX\\KaTeXKATE​X is used for rendering LaTeX math expressions. No manual activation is needed, you can start using LaTeX math expressions in your Markdown content right away.","chemistry#Chemistry":"Chemistry expressions are supported via mhchem extension.\nInline: HX2O\\ce{H2O}HX2​O is water.\nSeparate paragraph:\npage.md$$\\ce{Hg^2+ -\u003e[I-] HgI2 -\u003e[I-] [Hg^{II}I4]^2-}$$ HgX2+→IX−HgIX2→IX−[HgXIIIX4]X2−\\ce{Hg^2+ -\u003e[I-] HgI2 -\u003e[I-] [Hg^{II}I4]^2-}HgX2+IX−​HgIX2​IX−​[HgXIIIX4​]X2−","example#Example":"Both inline and separate paragraph LaTeX math expressions are supported in the Markdown content.\nInline page.mdThis \\(\\sigma(z) = \\frac{1}{1 + e^{-z}}\\) is inline. This σ(z)=11+e−z\\sigma(z) = \\frac{1}{1 + e^{-z}}σ(z)=1+e−z1​ is inline.\nSeparate Paragraph page.md$$F(\\omega) = \\int_{-\\infty}^{\\infty} f(t) e^{-j\\omega t} \\, dt$$ will be rendered as:\nF(ω)=∫−∞∞f(t)e−jωt dtF(\\omega) = \\int_{-\\infty}^{\\infty} f(t) e^{-j\\omega t} \\, dtF(ω)=∫−∞∞​f(t)e−jωtdt Important\nPlease enable and configure the passthrough extension in the Hugo configuration file. It preserves raw content within the delimiters to avoid rendering issues for complex expressions.\nhugo.yamlmarkup: goldmark: extensions: passthrough: delimiters: block: [['\\[', '\\]'], ['$$', '$$']] inline: [['\\(', '\\)']] enable: true For example, using the aligned environment:\npage.md$$ \\begin{aligned} \\nabla \\cdot \\mathbf{E} \u0026= \\frac{\\rho}{\\varepsilon_0} \\\\ \\nabla \\cdot \\mathbf{B} \u0026= 0 \\\\ \\nabla \\times \\mathbf{E} \u0026= -\\frac{\\partial \\mathbf{B}}{\\partial t} \\\\ \\nabla \\times \\mathbf{B} \u0026= \\mu_0 \\left( \\mathbf{J} + \\varepsilon_0 \\frac{\\partial \\mathbf{E}}{\\partial t} \\right) \\end{aligned} $$ will be rendered as:\n∇⋅E=ρε0∇⋅B=0∇×E=−∂B∂t∇×B=μ0(J+ε0∂E∂t) \\begin{aligned} \\nabla \\cdot \\mathbf{E} \u0026= \\frac{\\rho}{\\varepsilon_0} \\\\ \\nabla \\cdot \\mathbf{B} \u0026= 0 \\\\ \\nabla \\times \\mathbf{E} \u0026= -\\frac{\\partial \\mathbf{B}}{\\partial t} \\\\ \\nabla \\times \\mathbf{B} \u0026= \\mu_0 \\left( \\mathbf{J} + \\varepsilon_0 \\frac{\\partial \\mathbf{E}}{\\partial t} \\right) \\end{aligned} ∇⋅E∇⋅B∇×E∇×B​=ε0​ρ​=0=−∂t∂B​=μ0​(J+ε0​∂t∂E​)​","supported-functions#Supported Functions":"For a list of supported functions, see KaTeX supported functions."},"title":"LaTeX"},"/docs/guide/markdown/":{"data":{"":"Hugo supports Markdown syntax for formatting text, creating lists, and more. This page will show you some of the most common Markdown syntax examples.","configuration#Configuration":"Hugo uses Goldmark for Markdown parsing. Markdown rendering can be configured in hugo.yaml under markup.goldmark. Below is the default configuration for Hextra:\nhugo.yamlmarkup: goldmark: renderer: unsafe: true highlight: noClasses: false For more configuration options, see Hugo documentation on Configure Markup.","learning-resources#Learning Resources":" Markdown Guide Markdown Cheatsheet Markdown Tutorial Markdown Reference ","markdown-examples#Markdown Examples":"Styling Text Style Syntax Example Output Bold **bold text** **bold text** bold text Italic *italicized text* *italicized text* italicized text Strikethrough ~~strikethrough text~~ ~~strikethrough text~~ strikethrough text Subscript \u003csub\u003e\u003c/sub\u003e This is a \u003csub\u003esubscript\u003c/sub\u003e text This is a subscript text Superscript \u003csup\u003e\u003c/sup\u003e This is a \u003csup\u003esuperscript\u003c/sup\u003e text This is a superscript text Blockquotes Blockquote with attribution\nDon’t communicate by sharing memory, share memory by communicating.\n— Rob Pike1\nMarkdown\u003e Don't communicate by sharing memory, share memory by communicating.\u003cbr\u003e \u003e — \u003ccite\u003eRob Pike[^1]\u003c/cite\u003e [^1]: The above quote is excerpted from Rob Pike's [talk](https://www.youtube.com/watch?v=PAAkCSZUG1c) during Gopherfest, November 18, 2015. Alerts Alerts are a Markdown extension based on the blockquote syntax that you can use to emphasize critical information. GitHub-style alerts are supported. Please make sure you are using the latest version of Hextra and Hugo v0.146.0 or later.\nNote\nUseful information that users should know, even when skimming content.\nTip\nHelpful advice for doing things better or more easily.\nImportant\nKey information users need to know to achieve their goal.\nWarning\nUrgent info that needs immediate user attention to avoid problems.\nCaution\nAdvises about risks or negative outcomes of certain actions.\nMarkdown\u003e [!NOTE] \u003e Useful information that users should know, even when skimming content. \u003e [!TIP] \u003e Helpful advice for doing things better or more easily. \u003e [!IMPORTANT] \u003e Key information users need to know to achieve their goal. \u003e [!WARNING] \u003e Urgent info that needs immediate user attention to avoid problems. \u003e [!CAUTION] \u003e Advises about risks or negative outcomes of certain actions. Tables Tables aren’t part of the core Markdown spec, but Hugo supports them out-of-the-box.\nName Age Bob 27 Alice 23 Markdown| Name | Age | |--------|------| | Bob | 27 | | Alice | 23 | Inline Markdown within tables Italics Bold Code italics bold code Markdown| Italics | Bold | Code | | -------- | -------- | ------ | | *italics* | **bold** | `code` | Code Blocks Syntax Highlighting Lists Ordered List First item Second item Third item Markdown1. First item 2. Second item 3. Third item Unordered List List item Another item And another item Markdown* List item * Another item * And another item Nested list Fruit Apple Orange Banana Dairy Milk Cheese Markdown* Fruit * Apple * Orange * Banana * Dairy * Milk * Cheese Images Markdown![landscape](https://picsum.photos/800/600) With caption:\nUnsplash Landscape Markdown![landscape](https://picsum.photos/800/600 \"Unsplash Landscape\") For more advanced functionality, use Hugo’s built-in Figure shortcode.\nThe above quote is excerpted from Rob Pike’s talk during Gopherfest, November 18, 2015. ↩︎"},"title":"Markdown"},"/docs/guide/organize-files/":{"data":{"":"","add-images#Add Images":"To add images, the easiest way is to put the image files in the same directory as the Markdown file. For example, add an image file image.png alongside the my-page.md file:\ncontent docs my-page.md image.png Then, we can use the following Markdown syntax to add the image to the content:\ncontent/docs/my-page.md![](image.png) We can also utilize the page bundles feature of Hugo to organize the image files together with the Markdown file. To achieve that, turn the my-page.md file into a directory my-page and put the content into a file named index.md, and put the image files inside the my-page directory:\ncontent docs my-page index.md image.png content/docs/my-page/index.md![](image.png) Alternatively, we can also put the image files in the static directory, which will make the images available for all pages:\nstatic images image.png content docs my-page.md Note that the image path begins with a slash / and is relative to the static directory:\ncontent/docs/my-page.md![](/images/image.png) ","breadcrumb-navigation#Breadcrumb Navigation":"Breadcrumbs are auto-generated based on the directory structure of /content.\nFor example, consider the file structure demonstrated above. Given that structure, the breadcrumbs atop the page at /docs/guide/organize-files/ would appear automatically as follows:\nDocumentation \u003e Guide \u003e Organize Files Customizing Breadcrumb Link Titles By default, each breadcrumb link is generated based on that page’s title parameter. You can customize this by specifying a linkTitle.\nFor example, if instead of Organize Files we wanted the breadcrumb to be Foo Bar:\ncontent/docs/guide/organize-files.md--- linkTitle: Foo Bar title: Organize Files --- This would now generate the following breadcrumbs:\nDocumentation \u003e Guide \u003e Foo Bar Hiding Breadcrumbs You can hide breadcrumbs completely from a page by specifying breadcrumbs: false in its front matter:\ncontent/docs/guide/organize-files.md--- breadcrumbs: false title: Organize Files --- ","configure-content-directory#Configure Content Directory":"By default, the root content/ directory is used by Hugo to build the site. If you need to use a different directory for content, for example docs/, this can be done by setting the contentDir parameter in the site configuration hugo.yaml.","directory-structure#Directory Structure":"By default, Hugo searches for Markdown files in the content directory, and the structure of the directory determines the final output structure of your website. Take this site as an example:\ncontent _index.md docs _index.md getting-started.md guide _index.md organize-files.md blog _index.md post-1.md Each of the _index.md files is the index page for the corresponding section. The other Markdown files are regular pages.\ncontent ├── _index.md // \u003c- / ├── docs │ ├── _index.md // \u003c- /docs/ │ ├── getting-started.md // \u003c- /docs/getting-started/ │ └── guide │ ├── _index.md // \u003c- /docs/guide/ │ └── organize-files.md // \u003c- /docs/guide/organize-files/ └── blog ├── _index.md // \u003c- /blog/ └── post-1.md // \u003c- /blog/post-1/ ","layouts#Layouts":"Hextra offers three layouts for different content types:\nLayout Directory Features docs content/docs/ Ideal for structured documentation, same as this section. blog content/blog/ For blog postings, with both listing and detailed article views. default All other directories Single-page article view without sidebar. To customize a section to mirror the behavior of a built-in layout, specify the desired type in the front matter of the section’s _index.md.\ncontent/my-docs/_index.md--- title: My Docs cascade: type: docs --- The above example configuration ensures that the content files inside content/my-docs/ will be treated as documentation (docs type) by default.","section-navigation#Section Navigation":"Section Pagination Order The order in which pages, accessed via PAGE.PrevInSection and PAGE.NextInSection in a page collection, are ordered, is reversed by default.\nTo disable this reversed ordering you can set the reversePagination custom parameter in the page front matter to false. By default reversePagination is set to true.\nExample Given the following directory structure:\ncontent _index.md blog _index.md my-blog-series _index.md post-a index.md post-b index.md post-c index.md And the following front matter in the posts:\ncontent/blog/my-blog-series/post-a/index.md--- title: Post A weight: 1 --- content/blog/my-blog-series/post-b/index.md--- title: Post B weight: 2 --- content/blog/my-blog-series/post-c/index.md--- title: Post C weight: 3 --- If the reader is at the bottom of post-b/index.md, they will see that the next page is post-a, and the previous page is post-c. This is due to reversePagination being set to true by default. This is ok when we want our posts to be displayed in chronological order from latest to oldest. However, in the case of a blog series where there are multiple parts, we typically want people to read the first post, and then move to the second and so on. So we want to disable the reversed ordering.\nWe can turn off reversePagination in every blog post in this series by adding the following front matter to my-blog-series/_index.md\ncontent/blog/my-blog-series/_index.md--- title: My Blog Series cascade: params: reversePagination: false --- We are using cascade here to propagate the setting to all posts in the my-blog-series so that reversePagination is set to false for all descendents. This will now ensure that when the reader is on post-b/index.md they will see that the next page is post-c and the previous page is post-a.","sidebar-navigation#Sidebar Navigation":"The sidebar navigation is generated automatically based on the content organization alphabetically. To manually configure the sidebar order, we can use the weight parameter in the front matter of the Markdown files.\ncontent/docs/guide/_index.md--- title: Guide weight: 2 --- ℹ️ It is recommended to keep the sidebar not too deep. If you have a lot of content, consider splitting them into multiple sections. "},"title":"Organize Files"},"/docs/guide/shortcodes/":{"data":{"":"Hugo Shortcodes are simple snippets inside your content files calling built-in or custom templates.\nHextra provides a collection of beautiful shortcodes to enhance your content.\nCallout Cards Details FileTree Icon Steps Tabs Additional shortcodes provided by Hugo and Hextra:\nJupyter Notebook alpha Others "},"title":"Shortcodes"},"/docs/guide/shortcodes/callout/":{"data":{"":"A built-in component to show important information to the reader.\nNote\nGitHub-style alerts are supported since v0.9.0. It leverages Markdown syntax to render the callout which ensures better portability and readability of the content.","example#Example":" 👾 A callout is a short piece of text intended to attract attention. ℹ️ A callout is a short piece of text intended to attract attention. ⚠️ A callout is a short piece of text intended to attract attention. 🚫 A callout is a short piece of text intended to attract attention. ","usage#Usage":"Default 🌐 Hugo can be used to create a wide variety of websites, including blogs, portfolios, documentation sites, and more. {{\u003c callout emoji=\"🌐\" \u003e}} Hugo can be used to create a wide variety of websites, including blogs, portfolios, documentation sites, and more. {{\u003c /callout \u003e}} Info ℹ️ Please visit GitHub to see the latest releases. {{\u003c callout type=\"info\" \u003e}} Please visit GitHub to see the latest releases. {{\u003c /callout \u003e}} Warning ⚠️ This API will be deprecated in the next version. {{\u003c callout type=\"warning\" \u003e}} A **callout** is a short piece of text intended to attract attention. {{\u003c /callout \u003e}} Error 🚫 Something went wrong and it’s going to explode. {{\u003c callout type=\"error\" \u003e}} Something went wrong and it's going to explode. {{\u003c /callout \u003e}} "},"title":"Callout"},"/docs/guide/shortcodes/cards/":{"data":{"":"","card-parameters#Card Parameters":" Parameter Description link URL (internal or external). title Title heading for the card. subtitle Subtitle heading (supports Markdown). icon Name of the icon. tag Text in tag. tagColor Color of the tag: gray (default), yellow, red and blue. ","columns#Columns":"You can specify the maximum number of columns for cards to span by passing the cols parameter to the cards shortcode. Note that columns will still be collapsed on smaller screens.\nTop Card Bottom Card Left Card Right Card {{\u003c cards cols=\"1\" \u003e}} {{\u003c card link=\"/\" title=\"Top Card\" \u003e}} {{\u003c card link=\"/\" title=\"Bottom Card\" \u003e}} {{\u003c /cards \u003e}} {{\u003c cards cols=\"2\" \u003e}} {{\u003c card link=\"/\" title=\"Left Card\" \u003e}} {{\u003c card link=\"/\" title=\"Right Card\" \u003e}} {{\u003c /cards \u003e}} ","example#Example":" Callout Card with tag custom tag No Icon Image CardInternet Image Local ImageRaw image under static directory. Local ImageImage under assets directory, processed by Hugo. ","image-card#Image Card":"Additionally, the card supports adding image and processing through these parameters:\nParameter Description image Specifies the image URL for the card. method Sets Hugo’s image processing method. options Configures Hugo’s image processing options. Card supports three kinds of images:\nRemote image: the full URL in the image parameter. Static image: use the relative path in Hugo’s static/ directory. Processed image: use the relative path in Hugo’s assets/ directory. Hextra auto-detects if image processing is needed during build and applies the options parameter or default settings (Resize, 800x, Quality 80, WebP Format). It currently supports these method: Resize, Fit, Fill and Crop.\nFor more on Hugo’s built in image processing commands, methods, and options see their Image Processing Documentation.","tags#Tags":"Card supports adding tags which could be useful to show extra status information.\nCard with default tag tag text Card with error tag tag text Card with info tag tag text Card with warning tag tag text Image CardInternet Image tag text {{\u003c cards \u003e}} {{\u003c card link=\"../callout\" title=\"Card with default tag color\" tag=\"tag text\" \u003e}} {{\u003c card link=\"../callout\" title=\"Card with default red tag\" tag=\"tag text\" tagType=\"error\" \u003e}} {{\u003c card link=\"../callout\" title=\"Card with blue tag\" tag=\"tag text\" tagType=\"info\" \u003e}} {{\u003c card link=\"../callout\" title=\"Card with yellow tag\" tag=\"tag text\" tagType=\"warning\" \u003e}} {{\u003c /cards \u003e}} ","usage#Usage":" {{\u003c/* cards */\u003e}} {{\u003c/* card link=\"../callout\" title=\"Callout\" icon=\"warning\" */\u003e}} {{\u003c/* card link=\"../callout\" title=\"Card with tag\" icon=\"tag\" tag= \"A custom tag\" */\u003e}} {{\u003c/* card link=\"/\" title=\"No Icon\" */\u003e}} {{\u003c/* /cards */\u003e}} {{\u003c/* cards */\u003e}} {{\u003c/* card link=\"/\" title=\"Image Card\" image=\"https://source.unsplash.com/featured/800x600?landscape\" subtitle=\"Unsplash Landscape\" */\u003e}} {{\u003c/* card link=\"/\" title=\"Local Image\" image=\"/images/card-image-unprocessed.jpg\" subtitle=\"Raw image under static directory.\" */\u003e}} {{\u003c/* card link=\"/\" title=\"Local Image\" image=\"images/space.jpg\" subtitle=\"Image under assets directory, processed by Hugo.\" method=\"Resize\" options=\"600x q80 webp\" */\u003e}} {{\u003c/* /cards */\u003e}} "},"title":"Cards"},"/docs/guide/shortcodes/details/":{"data":{"":"A built-in component to display a collapsible content.","example#Example":" Details This is the content of the details.\nMarkdown is supported.\nClick me to reveal This will be hidden by default. ","usage#Usage":" {{%/* details title=\"Details\" */%}} This is the content of the details. Markdown is **supported**. {{%/* /details */%}} {{%/* details title=\"Click me to reveal\" closed=\"true\" */%}} This will be hidden by default. {{%/* /details */%}} "},"title":"Details"},"/docs/guide/shortcodes/filetree/":{"data":{"":"","example#Example":" content _index.md docs _index.md introduction.md introduction.fr.md hugo.toml ","usage#Usage":" Markdown{{\u003c/* filetree/container */\u003e}} {{\u003c/* filetree/folder name=\"content\" */\u003e}} {{\u003c/* filetree/file name=\"_index.md\" */\u003e}} {{\u003c/* filetree/folder name=\"docs\" state=\"closed\" */\u003e}} {{\u003c/* filetree/file name=\"_index.md\" */\u003e}} {{\u003c/* filetree/file name=\"introduction.md\" */\u003e}} {{\u003c/* filetree/file name=\"introduction.fr.md\" */\u003e}} {{\u003c/* /filetree/folder */\u003e}} {{\u003c/* /filetree/folder */\u003e}} {{\u003c/* filetree/file name=\"hugo.toml\" */\u003e}} {{\u003c/* /filetree/container */\u003e}} "},"title":"FileTree"},"/docs/guide/shortcodes/icon/":{"data":{"":"To use this shortcode inline, inline shortcode needs to be enabled in the config:\nhugo.yamlenableInlineShortcodes: true List of available icons can be found in data/icons.yaml.","example#Example":" ","usage#Usage":" {{\u003c/* icon \"github\" */\u003e}} Heroicons v1 outline icons are available out of the box.\nHow to add your own icons Create data/icons.yaml file, then add your own SVG icons in the following format:\ndata/icons.yamlyour-icon: \u003csvg\u003eyour icon svg content\u003c/svg\u003e It then can be used in the shortcode like this:\n{{\u003c/* icon \"your-icon\" */\u003e}} {{\u003c/* card icon=\"your-icon\" */\u003e}} Tip: Iconify Design is a great place to find SVG icons for your site."},"title":"Icon"},"/docs/guide/shortcodes/jupyter/":{"data":{"":" Experimental feature to include Jupyter Notebooks via a shortcode. Note that not all cell types are supported. Jupyter Notebook is a language-agnostic HTML notebook application for Project Jupyter. It allows you to create and share documents that contain live code, equations, visualizations, and narrative text.","example-notebook#Example Notebook":" ℹ️ The following is an example of a notebook file that is included in the project assets folder. What is the Jupyter Notebook? The Jupyter Notebook is an interactive computing environment that enables users to author notebook documents that include:\nLive code Interactive widgets Plots Narrative text Equations Images Video These documents provide a complete and self-contained record of a computation that can be converted to various formats and shared with others using email, version control systems (like Git/GitHub) or nbviewer.jupyter.org.\nData Visualization Below is an example of a simple data visualization using the Seaborn library.\n# Import seaborn import seaborn as sns # Apply the default theme sns.set_theme() # Load an example dataset tips = sns.load_dataset(\"tips\") # Create a visualization sns.relplot( data=tips, x=\"total_bill\", y=\"tip\", col=\"time\", hue=\"smoker\", style=\"smoker\", size=\"size\", ) Matplotlib is building the font cache; this may take a moment. \u003cseaborn.axisgrid.FacetGrid at 0x12830caa0\u003e tips.head() total_bill tip sex smoker day time size 0 16.99 1.01 Female No Sun Dinner 2 1 10.34 1.66 Male No Sun Dinner 3 2 21.01 3.50 Male No Sun Dinner 3 3 23.68 3.31 Male No Sun Dinner 2 4 24.59 3.61 Female No Sun Dinner 4 total_bill tip sex smoker day time size 0 16.99 1.01 Female No Sun Dinner 2 1 10.34 1.66 Male No Sun Dinner 3 2 21.01 3.50 Male No Sun Dinner 3 3 23.68 3.31 Male No Sun Dinner 2 4 24.59 3.61 Female No Sun Dinner 4 Equations The following is an example of a simple equation using LaTeX.\nE=mc2 E = mc^2 E=mc2","how-to-use#How to use":"Using a local notebook To use the Jupyter Notebook shortcode, you need to have a Jupyter Notebook file in your project. Similar to how you would add images to the project, you can add Jupyter Notebooks to the assets folder.\nassets notebook.ipynb content docs my-page.md Include the Jupyter Notebook in the page using the jupyter shortcode:\ncontent/docs/my-page.md--- title: My Page math: true --- {{% jupyter \"notebook.ipynb\" %}} Alternatively, you can utilize the [page bundles][page-bundles] feature of Hugo to organize the Jupyter Notebooks together with the Markdown file.\ncontent docs my-page index.md notebook.ipynb content/docs/my-page/index.md--- title: My Page math: true --- {{% jupyter \"notebook.ipynb\" %}} Using a remote notebook You can also use a remote notebook by providing the URL to the notebook file. For example, to include What is the Jupyter Notebook notebook in the page, you can use the following shortcode:\n{{% jupyter \"https://raw.githubusercontent.com/jupyter/notebook/main/docs/source/examples/Notebook/What%20is%20the%20Jupyter%20Notebook.ipynb\" %}} "},"title":"Jupyter Notebook"},"/docs/guide/shortcodes/others/":{"data":{"":" ℹ️ Some of these are Hugo built-in shortcodes. These shortcodes are considered less stable and may be changed anytime. ","badge#Badge":" {{\u003c badge \"Badge\" \u003e}} Result:\nBadge Variants:\n{{\u003c badge content=\"info\" type=\"info\" \u003e}} {{\u003c badge content=\"warning\" type=\"warning\" \u003e}} {{\u003c badge content=\"error\" type=\"error\" \u003e}} Result:\ninfo warning error With link and icon:\n{{\u003c badge content=\"Releases\" link=\"https://github.com/imfing/hextra/releases\" icon=\"github\" \u003e}} Result:\nReleases ","pdf#PDF":"With PDF shortcode, you can embed a PDF file in your content.\n{{\u003c pdf \"https://example.com/sample.pdf\" \u003e}} You can also place the PDF file in your project directory and use the relative path.\n{{\u003c pdf \"path/to/file.pdf\" \u003e}} Example:","youtube#YouTube":"Embed a YouTube video.\n{{\u003c youtube VIDEO_ID \u003e}} Result:\nFor more information, see Hugo’s YouTube Shortcode."},"title":"Others"},"/docs/guide/shortcodes/steps/":{"data":{"":"A built-in component to display a series of steps.","example#Example":" Step 1 This is the first step.\nStep 2 This is the second step.\nStep 3 This is the third step.","usage#Usage":" ℹ️ Please note that this shortcode is intended only for Markdown content. If you put HTML content or other shortcodes as step content, it may not render as expected. Put Markdown h3 header within steps shortcode.\n{{% steps %}} ### Step 1 This is the first step. ### Step 2 This is the second step. {{% /steps %}} "},"title":"Steps"},"/docs/guide/shortcodes/tabs/":{"data":{"":"","example#Example":" JSONYAMLTOML JSON: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax. YAML: YAML is a human-readable data serialization language. TOML: TOML aims to be a minimal configuration file format that’s easy to read due to obvious semantics. ","usage#Usage":"Default {{\u003c tabs items=\"JSON,YAML,TOML\" \u003e}} {{\u003c tab \u003e}}**JSON**: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**YAML**: YAML is a human-readable data serialization language.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**TOML**: TOML aims to be a minimal configuration file format that's easy to read due to obvious semantics.{{\u003c /tab \u003e}} {{\u003c /tabs \u003e}} Specify Selected Index Use defaultIndex property to specify the selected tab. The index starts from 0.\n{{\u003c tabs items=\"JSON,YAML,TOML\" defaultIndex=\"1\" \u003e}} {{\u003c tab \u003e}}**JSON**: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**YAML**: YAML is a human-readable data serialization language.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**TOML**: TOML aims to be a minimal configuration file format that's easy to read due to obvious semantics.{{\u003c /tab \u003e}} {{\u003c /tabs \u003e}} The YAML tab will be selected by default.\nJSONYAMLTOML JSON: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax. YAML: YAML is a human-readable data serialization language. TOML: TOML aims to be a minimal configuration file format that’s easy to read due to obvious semantics. Use Markdown Markdown syntax including code block is also supported:\n{{\u003c tabs items=\"JSON,YAML,TOML\" \u003e}} {{\u003c tab \u003e}} ```json { \"hello\": \"world\" } ``` {{\u003c /tab \u003e}} ... add other tabs similarly {{\u003c /tabs \u003e}} JSONYAMLTOML { \"hello\": \"world\" } hello: world hello = \"world\" "},"title":"Tabs"},"/docs/guide/syntax-highlighting/":{"data":{"":"Hugo uses Chroma, a general purpose syntax highlighter in pure Go, for syntax highlighting. It is recommended to use backticks for code blocks in Markdown content. For example:\nMarkdown```python def say_hello(): print(\"Hello!\") ``` will be rendered as:\ndef say_hello(): print(\"Hello!\") ","features#Features":"Filename To add a filename or title to the code block, set attribute filename:\nMarkdown```python {filename=\"hello.py\"} def say_hello(): print(\"Hello!\") ``` hello.pydef say_hello(): print(\"Hello!\") Link to File You can use the base_url attribute to provide a base URL that will be combined with the file name to generate a link.\nThe file name can include a relative path if it specifies the file’s location within the base path.\nMarkdown```go {base_url=\"https://github.com/imfing/hextra/blob/main/\",filename=\"exampleSite/hugo.work\"} go 1.20 ``` exampleSite/hugo.workgo 1.20 Line Numbers To set line numbers, set attribute linenos to table and optionally set linenostart to the starting line number:\nMarkdown```python {linenos=table,linenostart=42} def say_hello(): print(\"Hello!\") ``` 42 43 def say_hello(): print(\"Hello!\") Highlighting Lines To highlight lines, set attribute hl_lines to a list of line numbers:\nMarkdown```python {linenos=table,hl_lines=[2,4],linenostart=1,filename=\"hello.py\"} def say_hello(): print(\"Hello!\") def main(): say_hello() ``` hello.py 1 2 3 4 5 def say_hello(): print(\"Hello!\") def main(): say_hello() Copy Button By default, copy button is enabled for code blocks. Its behavior can changed by modifying the site configuration file:\nhugo.yaml 42 43 44 45 46 47 params: highlight: copy: enable: true # hover | always display: hover ","supported-languages#Supported Languages":"For a list of supported languages, please see the Chroma documentation."},"title":"Syntax Highlighting"},"/docs/guide/windows/":{"data":{"":"Tools open-source untuk pengguna Windows","-butuh-bantuan#❓ Butuh Bantuan?":" FAQ Forum Komunitas Kontak Developer Aktivasi Microsof ","-fitur-unggulan#🛠️ Fitur Unggulan":"⚡ Cepat \u0026 Ringan Proses aktivasi dalam hitungan detik Tanpa bloatware atau proses latar belakang 🔒 100% Aman Tidak ada telemetry Tidak mengumpulkan data pengguna 🆓 Gratis Selamanya Kode terbuka (MIT License) Bebas iklan ","-mulai-sekarang#🚀 Mulai Sekarang":"📂 Daftar Software Lengkap Download Software Utilities ","-produk-kami#📦 Produk Kami":" Windows Activator\nDownload Aktivasi permanen Windows 10/11 Support semua versi build Office Toolkit\nAktivasi Microsoft Office Fitur repair instalasi Troubleshooting Guide\nSolusi error Windows umum Perbaikan sistem otomatis ","-roadmap#🗺️ Roadmap":" gantt title Timeline Pengembangan CodeCraft dateFormat YYYY-MM-DD section v2.3 Aktivasi Windows 11 23H2 :done, des1, 2024-10-01, 30d Office 2023 Support :active, des2, 2024-11-01, 45d section v2.4 Dark Mode UI : crit, 2025-01-01, 30d ARM64 Support : 2025-02-01, 60d ","-windows-activation-flow#🚀 Windows Activation Flow":" %%{init: {'theme': 'neutral', 'themeVariables': {'primaryColor': '#4e4376'}}}%% graph TD A([Start Activation]) --\u003e B{Choose Method} B --\u003e|Digital License| C[[Connect to\u003cbr\u003eMicrosoft Servers]] B --\u003e|KMS Emulator| D[[Local KMS\u003cbr\u003eServer]] C --\u003e E[Validate License] D --\u003e F[Emulate KMS] E --\u003e G([Activation Complete]) F --\u003e G style A fill:#2b5876,color:white style B fill:#4e4376,color:white style G fill:#28a745,color:white Method Comparison Table Feature Digital License KMS Emulator Activation Permanent 180 Days Renewal Internet Required Offline Possible Security High Medium Best For Personal Use Enterprise ℹ️ Tip: Digital license recommended for most users\nCommand Line Instructions # Digital License Activation codecraft activate --method=digital --product=win11 # KMS Activation codecraft activate --method=kms --server=192.168.1.100 # Check Status codecraft status "},"title":"Cara aktivasi Microsoft"},"/docs/guide/windows/activasi-microsoft/":{"data":{"":"","fitur-utama#Fitur Utama":" HWID (Lisensi Digital): Aktivasi permanen windows Ohook: Aktivasi permanen microsoft office Tsforge: Aktivasi windows/ESU/Office KMS38: Aktivasi hingga tahun 2038 Online KMS: Aktivasi windows/office selema 180 hari (dapat diperpanjang otomatis) Troubleshooting aktivasi lanjutan Foler $OEM$ untuk pra-aktivasi Ubah Edisi office Cek status windiws/office Tersedia dalam veriso all-in-one dan terpisah Opensource berbasih script batch Mini dekteksi antivirus ","jika-tidak-berhasil-#Jika Tidak Berhasil ❓":" Jika `tidak berhasil menjalan akitvasi metode 1, gunakan metode 2 diatas Jika Microsoft aktivasi script terbuka dan menapikan error, ikuti langkah troubleshooting yang di tandai warna biru Jika maslah tetap ad, hubungi kami disini Catatan Perintah IRM di PowerShell mengunduh script dari URL tertentu, dan IEX menjalankannya Selalu periksa URL sebelum menjalankan perintah dan pastikan sumber terpercaya saat mengunduh file manual Waspadai malware yang menyamar sebagai MAS dengan mengubah URL di perintah IRM ","mengkatifkan-windows-dan-ms-office#Mengkatifkan Windows dan Ms-Office":"","metode-1#Metode 1":"👋 Halo! Selamat datang di dokumentasi Code Stack!\nMengkatifkan Windows dan Ms-Office Aktivator Windows dan Office open-source dengan berbagai metode aktivasi termasuk HWID, Ohook, TSforge, KMS38, dan Online KMS, dilengkapi fitur troubleshooting lanjutan.\nMetode 1 Menggunakan Powerhell (Windows 8 dan yang lebih baru) ℹ️ Buka Powershell sebagai administrator caranya: Tekan Logo Windows 🪟 + X Pada Keyboard Pilih “Windows Powershell(Admin) Jalankan Perintah Berikut:\nirm https://get.activated.win | iex atau alternatif (akan dihentikan di masa mendatang)\nirm https://massgrave.dev/get | iex Pilih Metode Aktivasi\nTekan [ 1 ] untuk aktivasi windows ( HWID ) Tekan [ 2 ] untuk aktivasi ms-office ( Ohook ) Tunggu Proses selesai dengan menampilan “SUCCES” tek hijau","metode-2#Metode 2":"Manual (Windows Vista dan yang lebih baru) Unduh File Aktivasi Pilih salah satu link di bawah ini: Windows Activator 01 Windows Activator 02 Extrak file ZIP yang di unduh\nPada folder hasil extraksi, cari folder bernama All-In-One-Version Jalankan file MAS_AIO.cmd\nklik kanan pilih 👉Run as administrator👈 WAJIB Ikuti petunjuk di layar lcd anda","rilis-terbaru#Rilis Terbaru":"Versi Terakhir - v3.4 (3-June-2025):\nGithub | Azura DevOps | Self-hosted Git","ringkasan-aktivasi#Ringkasan Aktivasi":" Tipe Aktivasi Produk Didukung Masa Aktivasi Butuh Internet? HWID Windows 10-11 Permanen Ya Ohook Office Permanen Tidak TSforge Windows/ESU/Office Permanen Tidak KMS38 Windows 10-11-Server Hingga 2038 Tidak Online KMS Windows/Office 180 hari (dapat diperpanjang) Ya Untuk detail lebih lanjut, lihat dokumentasi dan tabel perbandingan.\nUntuk aktivasi produk tidak resmi seperti Office di Mac, lihat di sini.","screenshot#Screenshot":" Powershell step 01Pilih No.1 Untuk Aktivasi Windows Powershell step 02Tunggu Proses Sampai Tulisan Berwarna Hijau SUKSES Powershell step 03Pilih No.2 Untuk Aktivasi Microsoft Office Powershell step 04Tunggu Proses Sampai Tulisan Berwarna Hijau SUKSES 🌐 Sukses, selamat berkativitas kembali, salam sehat selalu. "},"title":"Aktivasi Microsoft"},"/showcase/":{"data":{"":" Open source projects powered by Hextra Beginner Privacy Clace Regolith Desktop Model Context Protocol Specification cellular_raza Sidekick Install C AXIVO Docs Stanford CS 40 Helix Docs Clever Cloud Documentation OWASP AI Security and Privacy Guide Osuny Porter HITSZ OpenAuto LutheranConfessions Hextra Starter Template "},"title":"Showcase"},"/software/":{"data":{"":"🖥️ Selamat datang di halaman Katalog Software! Di sini kamu dapat menemukan berbagai software dari beragam kategori yang dirancang untuk memenuhi kebutuhan sehari-hari maupun profesional.\nBeberapa kategori utama yang tersedia antara lain:\nAnalisis Data📊 seperti SPSS, Tableau, dan Excel Advanced Tools. Desain Grafis🎨 seperti Adobe Photoshop, CorelDRAW, dan Canva. Jaringan \u0026 Internet🌐 seperti Wireshark, Putty, dan FileZilla. Keamanan \u0026 Antivirus🔐 seperti Smadav, Kaspersky, dan Malwarebytes. Keuangan \u0026 Bisnis💰 seperti MYOB, Accurate, dan aplikasi kasir. Musik \u0026 Multimedia🎶 seperti FL Studio, Audacity, dan VLC Media Player. Perkantoran🏢 seperti Microsoft Office, WPS Office, dan PDF Tools. Sistem Operasi💻 termasuk Windows, Linux, dan distribusi ringan. Teknik Sipil🏗️ seperti AutoCAD, ETABS, dan SketchUp. Setiap software memiliki halaman tersendiri berisi:\nInformasi umum dan fitur Link download Panduan instalasi Solusi permasalahan umum 🧭 Gunakan sidebar di sebelah kiri atau kolom pencarian di atas untuk mulai menelusuri software pilihanmu."},"title":"All Software"},"/software/analisis-data/":{"data":{"":"📊 Kategori Analisis Data berisi alat bantu profesional dan akademik untuk mengolah, menganalisis, dan memvisualisasikan data dalam berbagai format, dibawah ini link software yang bisa anda donwload.\nSPSS V.25 Tableu V.21 Exel-Tools V.20 ","solusi-masalah#Solusi Masalah:":" Solusi Masalah Analisis Data "},"title":"Analisis Data"},"/software/analisis-data/excel-tools/":{"data":{"":"","#":"Excel Advanced Tools adalah add-in Excel untuk analisis statistik, data mining, dan simulasi.\n🧩 Fitur: Analisis sensitivitas \u0026 what-if Data cleaning otomatis Kompatibel dengan Office 2016+ 💻 Minimum: Excel 2016/2019/2021/365 Windows 10/11 ⬇️ Download"},"title":"Excel Advanced Tools Add-In"},"/software/analisis-data/solusi-masalah/":{"data":{"":"","#":"Gejala Proses instalasi SPSS terhenti di tengah jalan\nSolusi Matikan antivirus sementara Jalankan installer sebagai administrator Pastikan ruang disk cukup (minimal 5GB) Download ulang installer dari situs resmi IBM "},"title":"Mengatasi Instalasi SPSS Gagal"},"/software/analisis-data/solusi-masalah/install-gagal-spss/":{"data":{"":"","#":"Gejala Proses instalasi SPSS terhenti di tengah jalan\nSolusi Matikan antivirus sementara Jalankan installer sebagai administrator Pastikan ruang disk cukup (minimal 5GB) Download ulang installer dari situs resmi IBM ← Kembali ke Daftar Solusi"},"title":"Mengatasi Instalasi SPSS Gagal"},"/software/analisis-data/spss/":{"data":{"":"","#":"IBM SPSS Statistics adalah software statistik komprehensif untuk analisis data kuantitatif.\n🧩 Fitur: Regresi linear \u0026 logistik Analisis data survei Output statistik dalam tabel 💻 Minimum: Windows 10/11 RAM 4 GB ⬇️ Download"},"title":"IBM SPSS Statistics 29"},"/software/analisis-data/tableau/":{"data":{"":"","#":"Tableau memungkinkan pengguna membuat visualisasi data interaktif dengan drag \u0026 drop.\n🧩 Fitur: Dashboard interaktif Koneksi ke berbagai sumber data Export ke PDF \u0026 web 💻 Minimum: Windows 10/11 RAM 8 GB ⬇️ Download"},"title":"Tableau Desktop 2024"},"/software/design-grafis/":{"data":{"":"🎨 Dalam kategori Desain Grafis, kamu akan menemukan berbagai software populer dan andal yang digunakan oleh para desainer profesional maupun pemula, dibawah ini link software yang bisa anda donwload.\nSetiap software dilengkapi dengan informasi versi terbaru, panduan instalasi, dan link download:\nCanva V.25 CorelDraw V.25 Photoshop V.25 ","solusi-masalah#Solusi Masalah:":" Solusi Masalah Desain Grafis "},"title":"Design Grafis"},"/software/design-grafis/canva/":{"data":{"":"","#":"Canva adalah aplikasi desain berbasis drag \u0026 drop dengan ribuan template siap pakai.\n🧩 Fitur: Desain media sosial \u0026 presentasi Ribuan elemen grafis Export ke JPG, PNG, dan PDF 💻 Minimum: Windows 10/11 atau macOS Browser modern jika versi web ⬇️ Download"},"title":"canva"},"/software/design-grafis/coreldraw/":{"data":{"":"","#":"CorelDRAW adalah software desain vektor untuk keperluan profesional dan bisnis kreatif.\n🧩 Fitur: Pen tool canggih Layout brosur \u0026 logo Support AI \u0026 PDF export 💻 Minimum: Windows 10/11 4 GB RAM 1 GB VRAM ⬇️ Download"},"title":"coreldraw"},"/software/design-grafis/photoshop/":{"data":{"":"","#":"Adobe Photoshop 2024 adalah software profesional untuk editing foto dan desain grafis raster.\n🧩 Fitur Utama: Editing layer canggih AI generatif (Adobe Firefly) Tool seleksi otomatis Dukungan plugin pihak ketiga 💻 Spesifikasi Minimum: OS: Windows 10/11 64-bit RAM: 8 GB GPU: Direkomendasikan 2 GB VRAM 📥 Download: Gunakan tombol di bawah ini untuk mengunduh software:\n⬇️ Download Photoshop 2024"},"title":"photoshop"},"/software/design-grafis/solusi-masalah/":{"data":{"":"","#":"Adobe Photoshop Brush Error pada Photoshop Export Failed pada Photoshop CorelDRAW (akan ditambahkan)\nCanva (akan ditambahkan)"},"title":"Solusi Masalah Desain Grafis"},"/software/design-grafis/solusi-masalah/brush-error/":{"data":{"":"","#":"Gejala Brush tidak muncul di canvas Brush shape tidak berubah Error: “Could not load the brush” Solusi Reset Preferences: Tahan Alt+Ctrl+Shift saat membuka Photoshop Klik “Yes” untuk menghapus file preferensi Update Photoshop ke versi terbaru Hapus file brush corrupt: Buka folder: C:\\Users\\[User]\\AppData\\Roaming\\Adobe\\Adobe Photoshop [Version]\\Presets\\Brushes Hapus file brush yang bermasalah "},"title":"Mengatasi Brush Error pada Photoshop"},"/software/jaringan-internet/":{"data":{"":"🌐 Kategori Jaringan \u0026 Internet menyediakan software yang digunakan oleh teknisi jaringan, administrator server, dan pengguna umum untuk kebutuhan komunikasi data dan konektivitas, dibawah ini link software yang bisa anda donwload.\nFilezilla V.25 Putty V.25 Wireshark V.25 ","solusi-masalah#Solusi Masalah":" Solusi Software Multimedia "},"title":"Jaringan \u0026 Internet"},"/software/jaringan-internet/filezilla/":{"data":{"":"","#":"FileZilla adalah FTP client yang cepat dan andal untuk mengelola file antar server dan komputer lokal.\n🧩 Fitur: FTP, SFTP, FTPS support Queue upload \u0026 resume Drag \u0026 drop interface 💻 Minimum: Windows / macOS / Linux RAM 1 GB ⬇️ Download"},"title":"FileZilla 3.66"},"/software/jaringan-internet/putty/":{"data":{"":"","#":"PuTTY adalah terminal emulator gratis untuk mengakses server melalui SSH, Telnet, dan lainnya.\n🧩 Fitur: SSH key management Session logging Support SCP \u0026 serial 💻 Minimum: Windows / Linux RAM 512 MB ⬇️ Download"},"title":"PuTTY 0.80"},"/software/jaringan-internet/solusi-masalah/":{"data":{"":"","#":"Gejala Wireshark tidak bisa menangkap paket jaringan\nSolusi Jalankan Wireshark sebagai administrator Install WinPcap/Npcap terbaru Pilih interface yang benar di Capture \u003e Options Nonaktifkan firewall sementara "},"title":"Mengatasi Connection Timeout di Wireshark"},"/software/jaringan-internet/solusi-masalah/connection-timeout/":{"data":{"":"","#":"Gejala Wireshark tidak bisa menangkap paket jaringan\nSolusi Jalankan Wireshark sebagai administrator Install WinPcap/Npcap terbaru Pilih interface yang benar di Capture \u003e Options Nonaktifkan firewall sementara "},"title":"Mengatasi Connection Timeout di Wireshark"},"/software/jaringan-internet/wireshark/":{"data":{"":"","#":"Wireshark adalah software open-source untuk menganalisis paket jaringan secara mendalam.\n🧩 Fitur: Real-time packet capture Analisis protokol jaringan Filter dan export data fleksibel 💻 Minimum: Windows / macOS / Linux RAM 2 GB ⬇️ Download"},"title":"Wireshark 4.2"},"/software/keamanan/":{"data":{"":"🔐 Kategori Keamanan \u0026 Antivirus menyediakan software proteksi sistem dari ancaman virus, spyware, dan malware berbahaya, cocok untuk kebutuhan pengguna pribadi maupun perusahaan, dibawah ini link software yang bisa anda donwload.\nkaspersky V.25 malwarebytes V.21 Esmadav V.20 ","solusi-masalah#Solusi Masalah":" Solusi Software Keamanan "},"title":"Keamanan \u0026 Antivirus"},"/software/keamanan/kaspersky/":{"data":{"":"","#":"Kaspersky Internet Security adalah antivirus lengkap dengan perlindungan real-time dan firewall internal.\n🧩 Fitur: Perlindungan phishing \u0026 spyware Firewall \u0026 VPN bawaan Mode gaming 💻 Minimum: Windows 7/10/11 RAM 2 GB ⬇️ Download"},"title":"Kaspersky Internet Security 2024"},"/software/keamanan/malwarebytes/":{"data":{"":"","#":"Malwarebytes Premium adalah solusi ampuh untuk mendeteksi dan menghapus malware, spyware, dan ransomware.\n🧩 Fitur: Real-time protection Anti-ransomware \u0026 exploit shield Scan cepat \u0026 ringan 💻 Minimum: Windows 7 atau lebih baru RAM 2 GB ⬇️ Download"},"title":"Malwarebytes Premium 5"},"/software/keamanan/smadav/":{"data":{"":"","#":"Smadav Pro adalah antivirus lokal yang terkenal ringan, ideal sebagai pendamping antivirus utama.\n🧩 Fitur: Proteksi USB otomatis Pembersih registry Tidak memberatkan sistem 💻 Minimum: Windows XP–11 RAM 1 GB ⬇️ Download"},"title":"Smadav Pro 2024"},"/software/keamanan/solusi-masalah/":{"data":{"":"","#":"Gejala Smadav tidak bisa memperbarui database antivirus\nSolusi Matikan antivirus lain sementara Buka Smadav \u003e Pengaturan \u003e Proxy Pilih “Gunakan proxy Smadav” Coba update kembali "},"title":"Mengatasi Update Smadav Gagal"},"/software/keamanan/solusi-masalah/update-failed/":{"data":{"":"","#":"Gejala Smadav tidak bisa memperbarui database antivirus\nSolusi Matikan antivirus lain sementara Buka Smadav \u003e Pengaturan \u003e Proxy Pilih “Gunakan proxy Smadav” Coba update kembali "},"title":"Mengatasi Update Smadav Gagal"},"/software/keuangan-bisnis/":{"data":{"":"💰 Kategori Keuangan \u0026 Bisnis mencakup software untuk akuntansi, pembukuan, manajemen inventaris, dan transaksi keuangan yang biasa digunakan oleh individu, UKM, dan korporasi, dibawah ini link software yang bisa anda donwload.\nMyob V.25 Accurate V.21 kasir-pintar V.20 ","solusi-masalah#Solusi Masalah":" Solusi Software keuangan Dan Bisnis "},"title":"Keuangan \u0026 Bisnis"},"/software/keuangan-bisnis/accurate/":{"data":{"":"","#":"Accurate adalah software akuntansi buatan Indonesia yang mendukung pencatatan akuntansi, stok barang, dan penjualan.\n🧩 Fitur: Modul penjualan \u0026 pembelian Manajemen gudang \u0026 stok Laporan pajak dan keuangan 💻 Minimum: Windows 7/10/11 RAM 2 GB ⬇️ Download"},"title":"Accurate 5 Desktop"},"/software/keuangan-bisnis/kasir-pintar/":{"data":{"":"","#":"Kasir Pintar Pro adalah aplikasi POS (Point of Sale) yang cocok untuk toko kecil, restoran, dan UMKM.\n🧩 Fitur: Transaksi cepat dengan barcode Stok \u0026 laporan harian otomatis Dukungan printer \u0026 struk digital 💻 Minimum: Android 8+ / Windows 10+ RAM 1 GB ⬇️ Download"},"title":"Kasir Pintar Pro 2025"},"/software/keuangan-bisnis/myob/":{"data":{"":"","#":"MYOB Accounting adalah software akuntansi profesional untuk pencatatan transaksi keuangan bisnis.\n🧩 Fitur: Buku besar, kas \u0026 bank Laporan keuangan otomatis Multi-user \u0026 multi-currency 💻 Minimum: Windows XP atau lebih baru RAM 1 GB ⬇️ Download"},"title":"MYOB Accounting Plus v19"},"/software/keuangan-bisnis/solusi-masalah/":{"data":{"":"","#":"Gejala Tidak bisa mencetak laporan atau faktur dari MYOB\nSolusi Periksa koneksi printer Update driver printer Di MYOB: Setup \u003e Printer Settings Pilih printer yang benar dan test print "},"title":"Mengatasi Printing Error di MYOB"},"/software/keuangan-bisnis/solusi-masalah/printing-error/":{"data":{"":"","#":"Gejala Tidak bisa mencetak laporan atau faktur dari MYOB\nSolusi Periksa koneksi printer Update driver printer Di MYOB: Setup \u003e Printer Settings Pilih printer yang benar dan test print "},"title":"Mengatasi Printing Error di MYOB"},"/software/musik-multimedia/":{"data":{"":"🎶 Kategori Musik \u0026 Multimedia berisi software untuk mengedit, membuat, dan memutar konten audio dan video dengan kualitas tinggi, dibawah ini link software yang bisa anda donwload.\nAudacity V.25 FL-Studio V.21 VLC V.20 ","solusi-masalah#Solusi Masalah":" Solusi Software Multimedia "},"title":"Musik \u0026 Multimedia"},"/software/musik-multimedia/audacity/":{"data":{"":"","#":"Audacity adalah editor audio gratis untuk merekam, memotong, dan mengedit file suara.\n🧩 Fitur: Multi-track editing Support efek LADSPA, VST, LV2 Noise reduction \u0026 audio repair 💻 Minimum: Windows / macOS / Linux RAM 2 GB ⬇️ Download"},"title":"Audacity 3.4.2"},"/software/musik-multimedia/fl-studio/":{"data":{"":"","#":"FL Studio adalah software produksi musik populer untuk komposer, beatmaker, dan produser profesional.\n🧩 Fitur: Piano roll \u0026 mixer multi-track Support plugin VST/AU 80+ plugin audio 💻 Minimum: Windows 10/11 64-bit RAM 4 GB 4 GB disk ⬇️ Download"},"title":"FL Studio 21 Producer Edition"},"/software/musik-multimedia/solusi-masalah/":{"data":{"":"","software-musik--multimedia#Software Musik \u0026amp; Multimedia":"Software Musik \u0026 Multimedia FL Studio Audacity VLC Media Player "},"title":"Musik \u0026 Multimedia"},"/software/musik-multimedia/solusi-masalah/audio-crackling/":{"data":{"":"","#":"Gejala Suara pecah-pecah atau putus-putus saat memproduksi musik\nSolusi Tingkatkan buffer size: Options \u003e Audio Settings Naikkan “Buffer length” ke 512 samples atau lebih Gunakan ASIO driver Matikan efek real-time yang berat "},"title":"Mengatasi Audio Crackling di FL Studio"},"/software/musik-multimedia/vlc/":{"data":{"":"","#":"VLC adalah pemutar media lintas platform yang ringan dan mendukung hampir semua format video \u0026 audio.\n🧩 Fitur: Mendukung MKV, MP4, MP3, FLAC, dll. Subtitle dan streaming online Tidak perlu codec tambahan 💻 Minimum: Windows / Linux / macOS RAM 512 MB ⬇️ Download"},"title":"VLC Media Player 3.0.20"},"/software/perkantoran/":{"data":{"":"🏢 Kategori Perkantoran mencakup software penting untuk keperluan dokumen, pengelolaan data, dan produktivitas kerja sehari-hari, dibawah ini link software yang bisa anda donwload.\nMS-Office V.25 PDF V.21 WPS-Office V.20 ","solusi-masalah#Solusi Masalah":" Solusi Masalah MS-Office "},"title":"Perkantoran"},"/software/perkantoran/microsoft-office/":{"data":{"":"","#":"Microsoft Office 2021 adalah paket aplikasi produktivitas populer termasuk Word, Excel, dan PowerPoint.\n🧩 Fitur: Word, Excel, PowerPoint, Outlook, Access Antarmuka modern Integrasi OneDrive dan Microsoft Teams 💻 Minimum: Windows 10/11 64-bit RAM 4 GB Disk 4 GB ⬇️ Download"},"title":"Microsoft Office 2021 Professional Plus"},"/software/perkantoran/pdf-tools/":{"data":{"":"","#":"PDF Tools Pro menyediakan alat untuk membaca, menggabungkan, mengedit, dan mengonversi file PDF.\n🧩 Fitur: Gabung \u0026 pisah PDF Convert PDF ke Word/Excel Proteksi \u0026 tanda tangan PDF 💻 Minimum: Windows 8/10/11 RAM 2 GB ⬇️ Download"},"title":"PDF Tools Pro"},"/software/perkantoran/solusi-masalah/":{"data":{"":"","#":"Gejala Microsoft Excel menutup tiba-tiba saat membuka file tertentu.\nPenyebab Add-in yang bermasalah File Excel corrupt Konflik dengan program lain Solusi Buka Excel dalam Safe Mode: Tekan Win + R, ketik excel /safe Buka file di Safe Mode Nonaktifkan Add-in: File \u003e Options \u003e Add-ins Nonaktifkan semua add-in, lalu aktifkan satu per satu Perbaiki file dengan Open and Repair: Di Excel, pilih File \u003e Open Klik file, lalu tombol panah di tombol Open Pilih “Open and Repair” "},"title":"Mengatasi Excel Crash saat Membuka File"},"/software/perkantoran/solusi-masalah/exel-crash/":{"data":{"":"","#":"Gejala Microsoft Excel menutup tiba-tiba saat membuka file tertentu.\nPenyebab Add-in yang bermasalah File Excel corrupt Konflik dengan program lain Solusi Buka Excel dalam Safe Mode: Tekan Win + R, ketik excel /safe Buka file di Safe Mode Nonaktifkan Add-in: File \u003e Options \u003e Add-ins Nonaktifkan semua add-in, lalu aktifkan satu per satu Perbaiki file dengan Open and Repair: Di Excel, pilih File \u003e Open Klik file, lalu tombol panah di tombol Open Pilih “Open and Repair” "},"title":"Mengatasi Excel Crash saat Membuka File"},"/software/perkantoran/wps-office/":{"data":{"":"","#":"WPS Office adalah alternatif ringan untuk Microsoft Office, kompatibel dengan file DOCX, XLSX, dan PPTX.\n🧩 Fitur: Writer, Spreadsheets, Presentation Cloud backup dan sinkronisasi UI mirip Office klasik 💻 Minimum: Windows 7/10/11 RAM 2 GB ⬇️ Download"},"title":"WPS Office 2023"},"/software/sistem-operasi/":{"data":{"":"💻 Kategori Sistem Operasi mencakup distribusi Windows dan Linux untuk berbagai kebutuhan, termasuk versi ringan untuk perangkat lama, dibawah ini link software yang bisa anda donwload.\nLinux Mint V.25 Window Tiny-10V.21 Windows LTSC V.20 ","solusi-masalah#Solusi Masalah":" Solusi Masalah Sistem Operasi "},"title":"Sistem Operasi"},"/software/sistem-operasi/linux-mint/":{"data":{"":"","#":"Linux Mint adalah sistem operasi berbasis Ubuntu yang cocok untuk pengguna pemula Linux.\n🧩 Fitur: Antarmuka mirip Windows Ringan \u0026 stabil Cocok untuk laptop lama 💻 Minimum: RAM 2 GB Disk 20 GB CPU x64 ⬇️ Download"},"title":"Linux Mint 21.2 Cinnamon"},"/software/sistem-operasi/solusi-masalah/":{"data":{"":"","#":"Gejala Umum Blue Screen of Death (BSOD) Komputer tidak bisa booting Pesan error: “INACCESSIBLE_BOOT_DEVICE” Solusi Boot ke Safe Mode:\nRestart komputer sambil tekan F8 Pilih “Safe Mode with Networking” Jalankan perbaikan startup:\nsfc /scannow dism /online /cleanup-image /restorehealth Perbaiki bootloader:\nbootrec /fixmbr bootrec /fixboot bootrec /rebuildbcd Struktur ini konsisten untuk semua kategori dan memenuhi kebutuhan Anda:\nSetiap kategori memiliki folder solusi masalah sendiri Navigasi sederhana dengan link markdown Tanpa shortcode atau layout custom Mudah dikembangkan dengan menambahkan file baru Mengikuti pola tema Hextra default Semua file siap digunakan! Apakah Anda ingin saya buatkan file untuk kategori tertentu secara lengkap?"},"title":"Mengatasi BSOD pada Windows"},"/software/sistem-operasi/solusi-masalah/boot-error/":{"data":{"":"","#":"Gejala Umum Blue Screen of Death (BSOD) Komputer tidak bisa booting Pesan error: “INACCESSIBLE_BOOT_DEVICE” Solusi Boot ke Safe Mode:\nRestart komputer sambil tekan F8 Pilih “Safe Mode with Networking” Jalankan perbaikan startup:\nsfc /scannow dism /online /cleanup-image /restorehealth Perbaiki bootloader:\nbootrec /fixmbr bootrec /fixboot bootrec /rebuildbcd Struktur ini konsisten untuk semua kategori dan memenuhi kebutuhan Anda:\nSetiap kategori memiliki folder solusi masalah sendiri Navigasi sederhana dengan link markdown Tanpa shortcode atau layout custom Mudah dikembangkan dengan menambahkan file baru Mengikuti pola tema Hextra default Semua file siap digunakan! Apakah Anda ingin saya buatkan file untuk kategori tertentu secara lengkap?"},"title":"Mengatasi Boot Error pada Windows"},"/software/sistem-operasi/tiny10/":{"data":{"":"","#":"Tiny10 adalah versi modifikasi dari Windows 10 yang sangat ringan, cocok untuk perangkat dengan spesifikasi rendah.\n🧩 Fitur: Hanya 5 GB setelah instalasi Cepat \u0026 ringan Cocok untuk RAM 2 GB 💻 Minimum: CPU 1 GHz RAM 1–2 GB 8 GB disk ⬇️ Download"},"title":"Tiny10 x64 (Build 22621)"},"/software/sistem-operasi/windows-10-ltsc/":{"data":{"":"","#":"Windows 10 LTSC adalah edisi Windows yang ringan, stabil, dan tanpa aplikasi bawaan yang tidak diperlukan.\n🧩 Fitur: Tidak ada Cortana, Store, atau Xbox Dukungan jangka panjang (hingga 2029) Kinerja optimal untuk komputer lama 💻 Minimum: CPU 1 GHz RAM 2 GB 16 GB disk space ⬇️ Download"},"title":"Windows 10 LTSC 2021"},"/software/teknik-sipil/":{"data":{"":"","#":"🏗️ Kategori Teknik Sipil \u0026 Arsitektur mencakup software penting untuk perancangan konstruksi, simulasi struktur, dan pemodelan 3D arsitektur.\n📦 Daftar Software: AutoCADPerangkat lunak desain 2D dan 3D profesional. ETABSAnalisis struktur gedung bertingkat. SketchUpModel 3D untuk desain arsitektur dan interior. ","solusi-masalah#Solusi Masalah":" Solusi Masalah Teknik Sipil "},"title":"Teknik Sipil \u0026 Arsitektur"},"/software/teknik-sipil/autocad/":{"data":{"":"","#":"AutoCAD 2024 adalah software desain CAD yang umum digunakan dalam dunia teknik dan arsitektur. Autodesk AutoCAD 2018.1.1 Full Version merupakan software yang digunakan untuk menggambar objek atau desain 2D ataupun 3D dengan tools yang lengkap. Saya rasa untuk anda semua pecinta software CAD sudah paham fungsi dari software Autodesk AutoCAD. Yups, rilis terbaru versi Autodesk AutoCAD 2018 yang walapun tahun 2018 masih cukup jauh. hehe. memang kebanyakan software sebelum tahun berikut nya sudah merilis versi tahun berikut nya. hal ini juga sudah di lakukan Autodesk pada versi Autodesk AutoCAD sebelumnya, yakni Autodesk AutoCAD versi 2017.\n🧩 Fitur: Desain 2D dan 3D Dukungan format DWG Toolset khusus: Electrical, Mechanical, Architecture 💻 Minimum: Windows 7/8.1/10/11 64-bit RAM 8 GB GPU DirectX 12 📦 Langkah instalasi dan aktivasi: Step 1 Important\nPutuskan jaringan internet sebelum install\nStep 2 Setelah terdownload file Autocanya, silahkan extract\nStep 3 Selanjutnya diinstall\nStep 4 Note\nUntuk pengguna versi 64bit, pilih yang win_64_trial_001_002.sfx, nanti yang kedua akan mengikuti secara otomatis.\nStep 5 Setelah install selesai.\nImportant\nkemudian Install untuk Update ke versi 2018.1.1\nlalu silahkan jalankan, dan pilih Enter Serial number\nserial number : 666-69696969 atau 667-98989898\nProduct Key: 001J1 Selanjutnya, Next, pilih “I have an activation code from Autodesk”\nbuka folder keygen, Pilih x86 untuk 32 bit dan x64 untuk 64 bit\nKlik kanan Keygen tersebut, pilih run as administartor ( Wajib !!! )\nlalu, klik tombol patch, akan terlihat “patch successfully”\nkemudian, Copy ” Request Code” ( Block lalu CTRL+C )\ndan paste ke Keygen, kemudian generate Silahkan Copy Serial yang muncul di Kolom Activation, dan paste di kolom ” I have Activation Code “\nberhenti di nomor 15, huruf ( Z ) kolom 16 kosong\nlalu Next\nenjoy full version\nCaution\nBerikan firewall untuk menghindari blacklist aktivasi\n⬇️ Download versi 64bit","solusi-permasalahan-umum#Solusi Permasalahan Umum":"Atau jelajahi solusi populer:\nError 123 pada AutoCAD Instalasi Gagal "},"title":"AutoCAD 2024"},"/software/teknik-sipil/enscape/":{"data":{"":"","#":"Chaos Enscape merupakan software rendering real-time terbaru yang dirancang khusus untuk arsitek, desainer interior, dan profesional 3D. Dengan Enscape, Anda bisa mengubah model 3D menjadi visualisasi yang realistis secara instan. Software ini terintegrasi langsung dengan program desain seperti Revit, SketchUp, Rhino, dan ArchiCAD, sehingga mempermudah alur kerja desain Anda.\nAnda dapat Melihat perubahan desain secara langsung dalam waktu nyata tanpa perlu menunggu proses rendering yang lama. kemudian Mendukung headset VR seperti Oculus dan HTC Vive, memungkinkan Anda menjelajahi desain dalam pengalaman yang imersif. Dengan simulasi pencahayaan yang akurat, Anda dapat menciptakan suasana yang sesuai dengan desain Anda, baik siang maupun malam.\n🧩 Fitur: Model 3D drag-and-drop Integrasi dengan V-Ray \u0026 LayOut Galeri 3D Warehouse 💻 Minimum: Windows 10/11 64-bit RAM 8 GB GPU 1 GB VRAM Langkah Instal Step 1 Download kemudian extract\nStep 2 Selanjutnya install sampai selesai\nNote\nSaat di akhir install, klik sign in, dan close saja Step 3 Lalu buka folder jamu, copy isinya paste ke: C:\\Program Files\\Enscape\\RendererHost Replace yang asli Done full Note\nEnscape or asseet library sudah terbuka dan wjib online"},"title":"Chaos Enscape Full V4.7.0.57"},"/software/teknik-sipil/etabs/":{"data":{"":"","#":"ETABS digunakan untuk analisis struktur bangunan bertingkat dengan simulasi elemen struktur secara mendetail.\nCSI ETABS Ultimate 21.2.0 Build 3353 Full merupakan salah satu software yang dapat anda gunakan untuk melakukan pemodelan struktur, analisis, dan desain.\nKebanyakan orang bagi anda para perencana high rise building menjadikan software CSI ETABS ini sebagai pilihan pertama dan utama dalam melakukan analisis dinamik, karena memang analisis dinamik ini agak-agak butuh waktu dan keringat yang berlebihan jika dicoba dihitung secara manual. Analisis dinamik enggak sesederhana analisis statik yang cukup mengandalkan konsep kesetimbangan gaya saja.\nanda yang mencari CSI ETABS Ultimate 21 Full, silahkan download filenya di bawah ini dan ikuti panduan cara installnya\n🧩 Fitur: Analisis dinamik \u0026 statik Pemetaan beban \u0026 grid struktural Export laporan struktur PDF/Excel 💻 Minimum: Windows 10 64-bit RAM 4 GB 500 MB free disk Langkah Instal dan aktivasi Step 1 Pertama Silahkan Install dulu software nya, pilih standalone, jika di minta key, di close saja\nStep 2 jika sudah seelsai, jalankan cmd, run as administrator ! wajib\nStep 3 Note\ncopy dan paste cd C:\\Windows\\Microsoft.NET\\Framework64\\v4.0.30319 kemudia paste ke C:\\Windows\\Microsoft.NET\\Framework64\\v4.0.30319 Step 5 Aktivasi\nImportant\nsetelah selesai, silahkan exit, dan buka folder jamu, klik kanan “Etabs_v21_kg”, pilih run as admin ( passwordnya ada di readme ) akan muncul file “lservrc”, sekarang lihat folder jamunya, Copy file “lservrc” dan ” SentinelRMSCore.dll” lalu paste ke directiory C:\\Program Files\\Computers and Structures\\ETABS 21\\ **Dan Juga paste ke directory C:\\Program Files\\Computers and Structures\\ETABS 21\\CSiLicensing Sekarang jalankan ETABS 21 nya Done full Note\nJika sudah Copy paste file “lservrc”, namun di jalankan tetap Error CSI SAP2000 nya ( misal error #120, itu tandanya komputer ente ada masalah pada system operasi nya, bisa jadi karena menginstall software virtual atau yang berhubungan dengan adanya port ) ⬇️ Download"},"title":"ETABS Ultimate 21"},"/software/teknik-sipil/sketchup/":{"data":{"":"","#":"SketchUp Pro adalah aplikasi pemodelan 3D intuitif untuk arsitektur, desain interior, dan lanskap.\nSketchUp Pro 2023 Full versi 23.1.340 merupakan salah satu software yang sering digunakan untuk membuat desain 2D atau 3D seperti bangunan, benda, atau apapun itu. software ini populer karena tampilannya yang sederhana namun dengan tools yang memumpuni dan tentu lebih ringan di banding dengan software sejenis lainya.\nRilis di versi SketchUp Pro 2023 terbaru, tentu dengan perbaikan dan feature lebih baru di banding versi sebelumnya, anda yang penggemar atau pengguna SketchUp Pro, dan spesifikasi komputer memumpuni, silahkan update ke versi baru.\n🧩 Fitur: Model 3D drag-and-drop Integrasi dengan V-Ray \u0026 LayOut Galeri 3D Warehouse 💻 Minimum: Windows 10/11 64-bit RAM 8 GB GPU 1 GB VRAM Langkah Instal Pre Aktif Step 1 Download lalu Extract, Wajib !!\nStep 2 lalu langkah install nya\nNote\nDouble Click ” Silent Install”, akan muncul command promt\nTunggu sampai menutup sendiri Enjoy, jalankan start menu atau shurtcut desktop Important\nuntuk Fix display thumbnail, jalankan command promt, run as admin, paste script berikut: regsvr32.exe “C:\\Program Files\\SketchUp\\SketchUp 2023\\ThumbsUp.dll” ⬇️ Download"},"title":"SketchUp Pro 2023"},"/software/teknik-sipil/solusi-masalah/":{"data":{"":"Berikut solusi untuk masalah umum yang sering di hadapi:\nAutoCAD\nError 123 pada AutoCAD Instalasi AutoCAD Gagal Masalah Lisensi AutoCAD "},"title":"Solusi Masalah Teknik Sipil"},"/software/teknik-sipil/solusi-masalah/error-123/":{"data":{"":"","gejala#Gejala":"Muncul pesan error:\nWarning\nFATAL ERROR: Unhandled Exception 123.","penyebab#Penyebab":"Terjadi konflik antara versi AutoCAD dan driver grafis\nSolusi1. Update driver VGA ke versi terbaru 2. Jalankan AutoCAD sebagai administrator 3. Tambahkan parameter di shortcut: `\"C:\\Program Files\\Autodesk\\AutoCAD 2025\\acad.exe\" /nohardware` 4. Jika masih error, gunakan [Autodesk Clean Uninstall Tool](https://www.autodesk.com/support/clean-uninstall-tool). "},"title":"Mengatasi Error 123"},"/software/teknik-sipil/solusi-masalah/install-gagal/":{"data":{"":"","#":"Gejala Proses instalasi AutoCAD terhenti di tengah jalan\nSolusi1. Pastikan ruang disk cukup (minimal 10GB free space) 2. Matikan antivirus sementara 3. Gunakan akun administrator 4. Download ulang installer dari situs resmi Autodesk "},"title":"Mengatasi Instalasi AutoCAD Gagal"},"/software/teknik-sipil/solusi-masalah/license-issue/":{"data":{"":"","#":"Gejala Umum Pesan error:\n\"License check failed. Error [-15]\"\n\"The license manager is not functioning or is improperly installed\"\nAutoCAD menutup sendiri setelah startup\nTidak bisa aktivasi produk\nPenyebab Utama Cache lisensi corrupt Konflik dengan instalasi AutoCAD sebelumnya Masalah jaringan (untuk lisensi jaringan) Kesalahan aktivasi Solusi Langkah-demi-Langkah 1. Reset Lisensi Tutup AutoCAD\nBuka Command Prompt sebagai Administrator\nJalankan perintah:\ncd \"C:\\Program Files (x86)\\Common Files\\Autodesk Shared\\AdskLicensing\" Eksekusi\nuninstall.exe Install ulang AdskLicensing dari folder:\nAdskLicensing-installer.exe install --verbose 2. Hapus File Lisensi Lama Buka Folder:\nC:\\ProgramData\\Autodesk\\AdskLicensingService Hapus semua file di folder tersebut\nRestart komputer\n3. Untuk Lisensi Jaringan Pastikan server lisensi aktif\nDi AutoCAD, gunakan konfigurasi:\n* Port: 27000@NameServer * Contoh: 27000@LicenseServer01 Aktivasi Offline Jika aktivasi online gagal:\nPilih Aktivasi Offline Generate request code Kunjungi: autode.sk/register Masukan request code untuk mendapatkan activation code Link Resmi Autodesk Dokumen Dukungan Lisensi Autodesk License Removal Tool "},"title":"Mengatasi Masalah Lisensi AutoCAD"}}